truncate table board;
truncate table members;
truncate table plan;
truncate table plan_detail;
truncate table content_type;

INSERT INTO `content_type` (content_type_id, type_name) VALUES
                                                            (0, '모든 관광지 유형'),
                                                            (12, '관광지'),
                                                            (14, '문화시설'),
                                                            (15, '축제 / 공연 / 행사'),
                                                            (25, '여행코스'),
                                                            (28, '레포츠'),
                                                            (32, '숙박'),
                                                            (38, '쇼핑'),
                                                            (39, '음식점');





INSERT INTO members (name, email_id, email_domain, password, phone, address, status, birthday, join_date)
VALUES
('관리자', 'admin', 'odysseyfrontiers.com', '1234', '010-1111-1111', '경상북도 구미시', 'ADMIN', '1999-09-22', '2024-05-10'),
('홍길동', 'honggildong', 'naver.com', 'password1', '010-1234-5678', '서울특별시 중구', 'ACTIVE', '1975-03-14', '2024-05-13'),
('김철수', 'kimcheolsu', 'google.com', 'password2', '010-2345-6789', '부산광역시 해운대구', 'ACTIVE', '1980-07-22', '2024-05-14'),
('이영희', 'leeyounghee', 'odysseyfrontiers.com', 'password3', '010-3456-7890', '대구광역시 수성구', 'ACTIVE', '1985-05-30', '2024-05-15'),
('박영수', 'parkyoungsu', 'naver.com', 'password4', '010-4567-8901', '인천광역시 남동구', 'ACTIVE', '1990-01-15', '2024-05-16'),
('최민호', 'choiminho', 'google.com', 'password5', '010-5678-9012', '광주광역시 북구', 'ACTIVE', '1995-09-10', '2024-05-17'),
('장미', 'jangmi', 'odysseyfrontiers.com', 'password6', '010-6789-0123', '대전광역시 서구', 'ACTIVE', '2000-12-25', '2024-05-18'),
('정우성', 'jungwoosung', 'naver.com', 'password7', '010-7890-1234', '울산광역시 중구', 'ACTIVE', '1972-11-11', '2024-05-19'),
('한지민', 'hanjimin', 'google.com', 'password8', '010-8901-2345', '경기도 수원시', 'ACTIVE', '1978-06-05', '2024-05-20'),
('김하늘', 'kimhaneul', 'odysseyfrontiers.com', 'password9', '010-9012-3456', '경상남도 창원시', 'ACTIVE', '1983-08-20', '2024-05-21'),
('강호동', 'kanghodong', 'naver.com', 'password10', '010-0123-4567', '충청남도 천안시', 'ACTIVE', '1991-03-03', '2024-05-22'),
('신동엽', 'shindongyeop', 'google.com', 'password11', '010-1234-6789', '전라북도 전주시', 'ACTIVE', '1998-04-18', '2024-05-23'),
('유재석', 'yoojaesuk', 'naver.com', 'password12', '010-2345-7890', '강원도 춘천시', 'ACTIVE', '1974-02-28', '2024-05-11'),
('박나래', 'parknarae', 'google.com', 'password13', '010-3456-8901', '제주특별자치도 제주시', 'ACTIVE', '1989-10-09', '2024-05-12'),
('송지효', 'songjihyo', 'odysseyfrontiers.com', 'password14', '010-4567-9012', '경기도 성남시', 'ACTIVE', '2003-07-07', '2024-05-13');


INSERT INTO board (member_id, subject, content, register_time, type)
VALUES
(1, '커뮤니티에 오신 것을 환영합니다', '우리 커뮤니티에 새로 오신 분들을 환영합니다.', '2024-05-13', 'notice'),
(2, '커뮤니티 가이드라인', '모두가 즐거운 경험을 할 수 있도록 커뮤니티 가이드라인을 읽고 따르세요.', '2024-05-14', 'notice'),
(3, '주간 업데이트', '이번 주 커뮤니티의 이벤트와 뉴스를 알려드립니다.', '2024-05-15', 'notice'),
(4, '새로운 기능 소개', '새로운 기능들을 소개합니다. 많이 이용해 주세요.', '2024-05-16', 'notice'),
(5, '정기 점검 안내', '이번 토요일 오전 1시부터 3시까지 정기 점검이 있을 예정입니다.', '2024-05-17', 'notice'),
(6, '스터디 모집', '다가오는 시험을 대비해 스터디를 모집합니다. 관심 있는 분들 연락 주세요.', '2024-05-18', 'community'),
(7, '영화 추천', '이번 주말에 영화 밤을 가질 예정입니다. 추천할 영화가 있나요?', '2024-05-19', 'community'),
(8, '요가 세션', '이번 일요일 오전 9시에 요가 세션에 참여하세요.', '2024-05-20', 'community'),
(9, '독서 모임', '다음 독서 모임은 수요일입니다. "위대한 개츠비"를 함께 읽어봅시다.', '2024-05-21', 'community'),
(10, '정원 가꾸기 팁', '정원 가꾸기 팁을 공유해 주세요.', '2024-05-22', 'community'),
(1, '레시피 교환', '즐겨먹는 레시피를 공유해요!', '2024-05-13', 'community'),
(2, '기술 토크', '최신 기술 트렌드에 대해 토론해 봅시다.', '2024-05-14', 'community'),
(3, '미술 전시회', '이번 금요일 커뮤니티 센터에서 미술 전시회가 열립니다.', '2024-05-15', 'community'),
(4, '자원봉사 기회', '다가오는 커뮤니티 청소 행사에 자원봉사자를 모집합니다.', '2024-05-16', 'community'),
(5, '분실물 센터', '잃어버린 물건이나 발견한 물건이 있으면 여기 게시해 주세요.', '2024-05-17', 'community'),
(6, '카풀', '도심까지 카풀할 사람을 찾습니다. 함께 이동해요.', '2024-05-18', 'community'),
(7, '피트니스 챌린지', '다음 월요일부터 30일 피트니스 챌린지에 참여하세요.', '2024-05-19', 'community'),
(8, '사진 콘테스트', '최고의 사진을 제출해 멋진 상품을 받으세요.', '2024-05-20', 'community'),
(9, '애완동물 입양 행사', '이번 토요일 공원에서 애완동물 입양 행사가 열립니다.', '2024-05-21', 'community'),
(10, '음악 잼 세션', '커뮤니티의 음악가들, 이번 금요일 저녁에 잼 세션을 가집시다.', '2024-05-22', 'community'),
(1, '언어 교환', '언어 교환 프로그램에 관심 있는 분들 함께해요. 서로에게 배워봅시다.', '2024-05-13', 'community'),
(2, 'DIY 워크샵', 'DIY 워크샵에 참여해 멋진 공예품을 만들어보세요.', '2024-05-14', 'community');


-- Create plan dummy data
-- Insert Plan Data
INSERT INTO plan (member_id, title, description, season, start_time, access_type, recent_update_time)
VALUES
(1, '봄 여행 계획', '봄에 여행 계획입니다.', 'SPRING', '2024-04-10 08:00:00', 'PUBLIC', '2024-04-10 08:00:00'),
(2, '여름 휴가 계획', '여름에 휴가를 계획합니다.', 'SUMMER', '2024-07-10 08:00:00', 'PUBLIC', '2024-07-10 08:00:00'),
(3, '가을 단풍 여행', '가을에 단풍을 보러 갑니다.', 'FALL', '2024-10-10 08:00:00', 'PUBLIC', '2024-10-10 08:00:00'),
(4, '겨울 스키 여행', '겨울에 스키를 타러 갑니다.', 'WINTER', '2024-12-10 08:00:00', 'PUBLIC', '2024-12-10 08:00:00'),
(5, '봄꽃 구경', '봄에 꽃을 구경하러 갑니다.', 'SPRING', '2024-04-15 08:00:00', 'PUBLIC', '2024-04-15 08:00:00'),
(6, '여름 해변 여행', '여름에 해변으로 여행갑니다.', 'SUMMER', '2024-07-20 08:00:00', 'PUBLIC', '2024-07-20 08:00:00'),
(7, '가을 국립공원 여행', '가을에 국립공원을 탐방합니다.', 'FALL', '2024-09-15 08:00:00', 'PUBLIC', '2024-09-15 08:00:00'),
(8, '겨울 온천 여행', '겨울에 온천을 즐기러 갑니다.', 'WINTER', '2024-12-20 08:00:00', 'PUBLIC', '2024-12-20 08:00:00'),
(9, '봄 캠핑', '봄에 캠핑을 갑니다.', 'SPRING', '2024-04-25 08:00:00', 'PUBLIC', '2024-04-25 08:00:00'),
(10, '여름 섬 여행', '여름에 섬으로 여행갑니다.', 'SUMMER', '2024-08-10 08:00:00', 'PUBLIC', '2024-08-10 08:00:00'),
(11, '가을 와이너리 투어', '가을에 와이너리 투어를 갑니다.', 'FALL', '2024-10-20 08:00:00', 'PUBLIC', '2024-10-20 08:00:00'),
(3, '겨울 여행', '겨울에 여행을 갑니다.', 'WINTER', '2024-12-30 08:00:00', 'PUBLIC', '2024-12-30 08:00:00'),
(5, '봄 나들이', '봄에 나들이를 갑니다.', 'SPRING', '2024-05-05 08:00:00', 'PUBLIC', '2024-05-05 08:00:00'),
(7, '여름 리조트 여행', '여름에 리조트로 여행갑니다.', 'SUMMER', '2024-08-15 08:00:00', 'PUBLIC', '2024-08-15 08:00:00'),
(9, '가을 여행', '가을에 여행을 갑니다.', 'FALL', '2024-09-25 08:00:00', 'PUBLIC', '2024-09-25 08:00:00');

-- Insert PlanDetail Data
INSERT INTO plan_detail (plan_id, day, content_id, description, plan_time)
VALUES
(1, 2, 1622907, '첫째 날 일정', '2024-04-10 10:00:00'),
(1, 3, 1622923, '둘째 날 일정', '2024-04-11 10:00:00'),
(1, 4, 1623646, '셋째 날 일정', '2024-04-12 10:00:00'),
(2, 2, 1623658, '첫째 날 일정', '2024-07-10 10:00:00'),
(2, 3, 1623668, '둘째 날 일정', '2024-07-11 10:00:00'),
(2, 4, 1623687, '셋째 날 일정', '2024-07-12 10:00:00'),
(2, 5, 1623698, '넷째 날 일정', '2024-07-13 10:00:00'),
(3, 2, 1623712, '첫째 날 일정', '2024-10-10 10:00:00'),
(3, 3, 1623717, '둘째 날 일정', '2024-10-11 10:00:00'),
(3, 4, 1623735, '셋째 날 일정', '2024-10-12 10:00:00'),
(4, 2, 1623743, '첫째 날 일정', '2024-12-10 10:00:00'),
(4, 3, 1623747, '둘째 날 일정', '2024-12-11 10:00:00'),
(4, 4, 1623750, '셋째 날 일정', '2024-12-12 10:00:00'),
(5, 2, 1623761, '첫째 날 일정', '2024-04-15 10:00:00'),
(5, 3, 1623764, '둘째 날 일정', '2024-04-16 10:00:00'),
(5, 4, 1623767, '셋째 날 일정', '2024-04-17 10:00:00'),
(6, 2, 1623771, '첫째 날 일정', '2024-07-20 10:00:00'),
(6, 3, 1623794, '둘째 날 일정', '2024-07-21 10:00:00'),
(6, 4, 1623801, '셋째 날 일정', '2024-07-22 10:00:00'),
(7, 2, 1623806, '첫째 날 일정', '2024-09-15 10:00:00'),
(7, 3, 1623810, '둘째 날 일정', '2024-09-16 10:00:00'),
(7, 4, 1623828, '셋째 날 일정', '2024-09-17 10:00:00'),
(8, 2, 1623859, '첫째 날 일정', '2024-12-20 10:00:00'),
(8, 3, 1623888, '둘째 날 일정', '2024-12-21 10:00:00'),
(8, 4, 1623912, '셋째 날 일정', '2024-12-22 10:00:00'),
(9, 2, 1623927, '첫째 날 일정', '2024-04-25 10:00:00'),
(9, 3, 1623931, '둘째 날 일정', '2024-04-26 10:00:00'),
(9, 4, 1623937, '셋째 날 일정', '2024-04-27 10:00:00'),
(10, 2, 1623977, '첫째 날 일정', '2024-08-10 10:00:00'),
(10, 3, 1623995, '둘째 날 일정', '2024-08-11 10:00:00'),
(10, 4, 1624013, '셋째 날 일정', '2024-08-12 10:00:00'),
(11, 2, 1624029, '첫째 날 일정', '2024-10-20 10:00:00'),
(11, 3, 1624039, '둘째 날 일정', '2024-10-21 10:00:00'),
(11, 4, 1624064, '셋째 날 일정', '2024-10-22 10:00:00'),
(12, 2, 1624070, '첫째 날 일정', '2024-12-30 10:00:00'),
(12, 3, 1624075, 'Second day of winter travel', '2024-12-31 10:00:00'),
(12, 4, 1624083, 'Third day of winter travel', '2025-01-01 10:00:00'),

(13, 2, 1624105, 'First day of spring outing', '2024-04-20 10:00:00'),
(13, 3, 1624116, 'Second day of spring outing', '2024-04-21 10:00:00'),
(13, 4, 1624129, 'Third day of spring outing', '2024-04-22 10:00:00'),

(14, 2, 1624135, 'First day of summer resort', '2024-07-25 10:00:00'),
(14, 3, 1624140, 'Second day of summer resort', '2024-07-26 10:00:00'),
(14, 4, 1624144, 'Third day of summer resort', '2024-07-27 10:00:00'),

(15, 2, 1624164, 'First day of fall trip', '2024-09-30 10:00:00'),
(15, 3, 1624167, 'Second day of fall trip', '2024-10-01 10:00:00'),
(15, 4, 1624171, 'Third day of fall trip', '2024-10-02 10:00:00');


